Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_adc_type.h
#ifndef _RTL8735B_ADC_TYPE_H_
#define _RTL8735B_ADC_TYPE_H_

/**************************************************************************//**
 * @defgroup ADC_CONF
 * @brief  ADC Configuration Register                (@ 0X000)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_EN                            9
#define ADC_BIT_EN                              ((u32)0x00000001 << 9)                              /*!<R/W 0  This bit is for ADC enable control. */
#define ADC_SHIFT_CVLIST_LEN                    4
#define ADC_MASK_CVLIST_LEN                     ((u32)0x0000000F << 4)                              /*!<R/W 0  This field defines the number of items in the ADC conversion channel list. 0 is for 1 item in list. 1 is for 2 items in list. */
#define ADC_SHIFT_OP_MOD                        1
#define ADC_MASK_OP_MOD                         ((u32)0x00000007 << 1)                              /*!<R/W 0  These bits selects ADC operation mode. 0: Software Trigger Mode 1: Automatic Mode 2: Timer-Trigger Mode */
#define ADC_SHIFT_REF_IN_SEL                    0
#define ADC_BIT_REF_IN_SEL                      ((u32)0x00000001 << 0)                              /*!<R/W 0  This bit selects ADC reference voltage input. 0: ADC's reference voltage is from internal source. 1: ADC's reference voltage is from external pin. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_IN_TYPE
 * @brief  ADC Input Type Register                   (@ 0X004)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CH7_IN_TYPE                   7
#define ADC_BIT_CH7_IN_TYPE                     ((u32)0x00000001 << 7)                              /*!<R/W 0  This bit controls channel 7 input type. If it is set to differential type (value of this bit is 1), channel 6 should also be set to differential type since they are hardware-fixed differential pair. 0: ADC channel 7 is single-end input. 1: ADC channel 7 is differential input which is paired with channel 6. */
#define ADC_SHIFT_CH6_IN_TYPE                   6
#define ADC_BIT_CH6_IN_TYPE                     ((u32)0x00000001 << 6)                              /*!<R/W 0  This bit controls channel 6 input type. If it is set to differential type (value of this bit is 1), channel 7 should also be set to differential type since they are hardware-fixed differential pair. 0: ADC channel 6 is single-end input. 1: ADC channel 6 is differential input which is paired with channel 7. */
#define ADC_SHIFT_CH5_IN_TYPE                   5
#define ADC_BIT_CH5_IN_TYPE                     ((u32)0x00000001 << 5)                              /*!<R/W 0  This bit controls channel 5 input type. If it is set to differential type (value of this bit is 1), channel 4 should also be set to differential type since they are hardware-fixed differential pair. 0: ADC channel 5 is single-end input. 1: ADC channel 5 is differential input which is paired with channel 4. */
#define ADC_SHIFT_CH4_IN_TYPE                   4
#define ADC_BIT_CH4_IN_TYPE                     ((u32)0x00000001 << 4)                              /*!<R/W 0  This bit controls channel 4 input type. If it is set to differential type (value of this bit is 1), channel 5 should also be set to differential type since they are hardware-fixed differential pair. 0: ADC channel 4 is single-end input. 1: ADC channel 4 is differential input which is paired with channel 5. */
#define ADC_SHIFT_CH3_IN_TYPE                   3
#define ADC_BIT_CH3_IN_TYPE                     ((u32)0x00000001 << 3)                              /*!<R/W 0  This bit controls channel 3 input type. If it is set to differential type (value of this bit is 1), channel 2 should also be set to differential type since they are hardware-fixed differential pair. 0: ADC channel 3 is single-end input. 1: ADC channel 3 is differential input which is paired with channel 2. */
#define ADC_SHIFT_CH2_IN_TYPE                   2
#define ADC_BIT_CH2_IN_TYPE                     ((u32)0x00000001 << 2)                              /*!<R/W 0  This bit controls channel 2 input type. If it is set to differential type (value of this bit is 1), channel 3 should also be set to differential type since they are hardware-fixed differential pair. 0: ADC channel 2 is single-end input. 1: ADC channel 2 is differential input which is paired with channel 3. */
#define ADC_SHIFT_CH1_IN_TYPE                   1
#define ADC_BIT_CH1_IN_TYPE                     ((u32)0x00000001 << 1)                              /*!<R/W 0  This bit controls channel 1 input type. If it is set to differential type (value of this bit is 1), channel 0 should also be set to differential type since they are hardware-fixed differential pair. 0: ADC channel 1 is single-end input. 1: ADC channel 1 is differential input which is paired with channel 0. */
#define ADC_SHIFT_CH0_IN_TYPE                   0
#define ADC_BIT_CH0_IN_TYPE                     ((u32)0x00000001 << 0)                              /*!<R/W 0  This bit controls channel 0 input type. If it is set to differential type (value of this bit is 1), channel 1 should also be set to differential type since they are hardware-fixed differential pair. 0: ADC channel 0 is single-end input. 1: ADC channel 0 is differential input which is paired with channel 1. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_COMP_TH_CH0
 * @brief  ADC Channel 0 Comparison Threshold Register (@ 0X008)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CH0_TH_H                      16
#define ADC_MASK_CH0_TH_H                       ((u32)0x00000FFF << 16)                             /*!<R/W 0  This field defines the higher threshold of channel 0 for ADC automatic comparison. */
#define ADC_SHIFT_CH0_TH_L                      0
#define ADC_MASK_CH0_TH_L                       ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field defines the lower threshold of channel 0 for ADC automatic comparison. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_COMP_TH_CH1
 * @brief  ADC Channel 1 Comparison Threshold Register (@ 0X00C)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CH1_TH_H                      16
#define ADC_MASK_CH1_TH_H                       ((u32)0x00000FFF << 16)                             /*!<R/W 0  This field defines the higher threshold of channel 1 for ADC automatic comparison. */
#define ADC_SHIFT_CH1_TH_L                      0
#define ADC_MASK_CH1_TH_L                       ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field defines the lower threshold of channel 1 for ADC automatic comparison. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_COMP_TH_CH2
 * @brief  ADC Channel 2 Comparison Threshold Register (@ 0X010)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CH2_TH_H                      16
#define ADC_MASK_CH2_TH_H                       ((u32)0x00000FFF << 16)                             /*!<R/W 0  This field defines the higher threshold of channel 2 for ADC automatic comparison. */
#define ADC_SHIFT_CH2_TH_L                      0
#define ADC_MASK_CH2_TH_L                       ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field defines the lower threshold of channel 2 for ADC automatic comparison. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_COMP_TH_CH3
 * @brief  ADC Channel 3 Comparison Threshold Register (@ 0X014)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CH3_TH_H                      16
#define ADC_MASK_CH3_TH_H                       ((u32)0x00000FFF << 16)                             /*!<R/W 0  This field defines the higher threshold of channel 3 for ADC automatic comparison. */
#define ADC_SHIFT_CH3_TH_L                      0
#define ADC_MASK_CH3_TH_L                       ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field defines the lower threshold of channel 3 for ADC automatic comparison. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_COMP_TH_CH4
 * @brief  ADC Channel 4 Comparison Threshold Register (@ 0X018)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CH4_TH_H                      16
#define ADC_MASK_CH4_TH_H                       ((u32)0x00000FFF << 16)                             /*!<R/W 0  This field defines the higher threshold of channel 4 for ADC automatic comparison. */
#define ADC_SHIFT_CH4_TH_L                      0
#define ADC_MASK_CH4_TH_L                       ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field defines the lower threshold of channel 4 for ADC automatic comparison. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_COMP_TH_CH5
 * @brief  ADC Channel 5 Comparison Threshold Register (@ 0X01C)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CH5_TH_H                      16
#define ADC_MASK_CH5_TH_H                       ((u32)0x00000FFF << 16)                             /*!<R/W 0  This field defines the higher threshold of channel 5 for ADC automatic comparison. */
#define ADC_SHIFT_CH5_TH_L                      0
#define ADC_MASK_CH5_TH_L                       ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field defines the lower threshold of channel 5 for ADC automatic comparison. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_COMP_TH_CH6
 * @brief  ADC Channel 6 Comparison Threshold Register (@ 0X020)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CH6_TH_H                      16
#define ADC_MASK_CH6_TH_H                       ((u32)0x00000FFF << 16)                             /*!<R/W 0  This field defines the higher threshold of channel 6 for ADC automatic comparison. */
#define ADC_SHIFT_CH6_TH_L                      0
#define ADC_MASK_CH6_TH_L                       ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field defines the lower threshold of channel 6 for ADC automatic comparison. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_COMP_TH_CH7
 * @brief  ADC Channel 7 Comparison Threshold Register (@ 0X024)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CH7_TH_H                      16
#define ADC_MASK_CH7_TH_H                       ((u32)0x00000FFF << 16)                             /*!<R/W 0  This field defines the higher threshold of channel 7 for ADC automatic comparison. */
#define ADC_SHIFT_CH7_TH_L                      0
#define ADC_MASK_CH7_TH_L                       ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field defines the lower threshold of channel 7 for ADC automatic comparison. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_COMP_TH_CH8
 * @brief  ADC Channel 8 Comparison Threshold Register (@ 0X028)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CH8_TH_H                      16
#define ADC_MASK_CH8_TH_H                       ((u32)0x00000FFF << 16)                             /*!<R/W 0  This field defines the higher threshold of channel 8 for ADC automatic comparison. */
#define ADC_SHIFT_CH8_TH_L                      0
#define ADC_MASK_CH8_TH_L                       ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field defines the lower threshold of channel 8 for ADC automatic comparison. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_COMP_CTRL
 * @brief  ADC Comparison Control Register           (@ 0X02C)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CH8_COMP_CTRL                 16
#define ADC_MASK_CH8_COMP_CTRL                  ((u32)0x00000003 << 16)                             /*!<R/W 0  This field defines ADC channel comparison criteria which would notify system by interrupt when the criterion matches. Once a criterion matches, ADC should send an interrupt signal to system if the related interrupt mask is unmask. ADC also updates comparison results in REG_ADC_COMP_STS. 0: When Vin < BIT_ADC_COMP_TH_L_CH8, comparison criterion matches. 1: When Vin > BIT_ADC_COMP_TH_H_CH8, comparison criterion matches. 2: When Vin >= BIT_ADC_COMP_TH_L_CH8 and Vin <= BIT_ADC_COMP_TH_H_CH8, comparison criterion matches. 3: When Vin < BIT_ADC_COMP_TH_L_CH8 or Vin > BIT_ADC_COMP_TH_H_CH8,comparison criterion matches. */
#define ADC_SHIFT_CH7_COMP_CTRL                 14
#define ADC_MASK_CH7_COMP_CTRL                  ((u32)0x00000003 << 14)                             /*!<R/W 0  This field defines ADC channel comparison criteria which would notify system by interrupt when the criterion matches. Once a criterion matches, ADC should send an interrupt signal to system if the related interrupt mask is unmask. ADC also updates comparison results in REG_ADC_COMP_STS. 0: When Vin < BIT_ADC_COMP_TH_L_CH7, comparison criterion matches. 1: When Vin > BIT_ADC_COMP_TH_H_CH7, comparison criterion matches. 2: When Vin >= BIT_ADC_COMP_TH_L_CH7 and Vin <= BIT_ADC_COMP_TH_H_CH7, comparison criterion matches. 3: When Vin < BIT_ADC_COMP_TH_L_CH7 or Vin > BIT_ADC_COMP_TH_H_CH7,comparison criterion matches. */
#define ADC_SHIFT_CH6_COMP_CTRL                 12
#define ADC_MASK_CH6_COMP_CTRL                  ((u32)0x00000003 << 12)                             /*!<R/W 0  This field defines ADC channel comparison criteria which would notify system by interrupt when the criterion matches. Once a criterion matches, ADC should send an interrupt signal to system if the related interrupt mask is unmask. ADC also updates comparison results in REG_ADC_COMP_STS. 0: When Vin < BIT_ADC_COMP_TH_L_CH6, comparison criterion matches. 1: When Vin > BIT_ADC_COMP_TH_H_CH6, comparison criterion matches. 2: When Vin >= BIT_ADC_COMP_TH_L_CH6 and Vin <= BIT_ADC_COMP_TH_H_CH6, comparison criterion matches. 3: When Vin < BIT_ADC_COMP_TH_L_CH6 or Vin > BIT_ADC_COMP_TH_H_CH6,comparison criterion matches. */
#define ADC_SHIFT_CH5_COMP_CTRL                 10
#define ADC_MASK_CH5_COMP_CTRL                  ((u32)0x00000003 << 10)                             /*!<R/W 0  This field defines ADC channel comparison criteria which would notify system by interrupt when the criterion matches. Once a criterion matches, ADC should send an interrupt signal to system if the related interrupt mask is unmask. ADC also updates comparison results in REG_ADC_COMP_STS. 0: When Vin < BIT_ADC_COMP_TH_L_CH5, comparison criterion matches. 1: When Vin > BIT_ADC_COMP_TH_H_CH5, comparison criterion matches. 2: When Vin >= BIT_ADC_COMP_TH_L_CH5 and Vin <= BIT_ADC_COMP_TH_H_CH5, comparison criterion matches. 3: When Vin < BIT_ADC_COMP_TH_L_CH5 or Vin > BIT_ADC_COMP_TH_H_CH5,comparison criterion matches. */
#define ADC_SHIFT_CH4_COMP_CTRL                 8
#define ADC_MASK_CH4_COMP_CTRL                  ((u32)0x00000003 << 8)                              /*!<R/W 0  This field defines ADC channel comparison criteria which would notify system by interrupt when the criterion matches. Once a criterion matches, ADC should send an interrupt signal to system if the related interrupt mask is unmask. ADC also updates comparison results in REG_ADC_COMP_STS. 0: When Vin < BIT_ADC_COMP_TH_L_CH4, comparison criterion matches. 1: When Vin > BIT_ADC_COMP_TH_H_CH4, comparison criterion matches. 2: When Vin >= BIT_ADC_COMP_TH_L_CH4 and Vin <= BIT_ADC_COMP_TH_H_CH4, comparison criterion matches. 3: When Vin < BIT_ADC_COMP_TH_L_CH4 or Vin > BIT_ADC_COMP_TH_H_CH4,comparison criterion matches. */
#define ADC_SHIFT_CH3_COMP_CTRL                 6
#define ADC_MASK_CH3_COMP_CTRL                  ((u32)0x00000003 << 6)                              /*!<R/W 0  This field defines ADC channel comparison criteria which would notify system by interrupt when the criterion matches. Once a criterion matches, ADC should send an interrupt signal to system if the related interrupt mask is unmask. ADC also updates comparison results in REG_ADC_COMP_STS. 0: When Vin < BIT_ADC_COMP_TH_L_CH3, comparison criterion matches. 1: When Vin > BIT_ADC_COMP_TH_H_CH3, comparison criterion matches. 2: When Vin >= BIT_ADC_COMP_TH_L_CH3 and Vin <= BIT_ADC_COMP_TH_H_CH3, comparison criterion matches. 3: When Vin < BIT_ADC_COMP_TH_L_CH3 or Vin > BIT_ADC_COMP_TH_H_CH3,comparison criterion matches. */
#define ADC_SHIFT_CH2_COMP_CTRL                 4
#define ADC_MASK_CH2_COMP_CTRL                  ((u32)0x00000003 << 4)                              /*!<R/W 0  This field defines ADC channel comparison criteria which would notify system by interrupt when the criterion matches. Once a criterion matches, ADC should send an interrupt signal to system if the related interrupt mask is unmask. ADC also updates comparison results in REG_ADC_COMP_STS. 0: When Vin < BIT_ADC_COMP_TH_L_CH2, comparison criterion matches. 1: When Vin > BIT_ADC_COMP_TH_H_CH2, comparison criterion matches. 2: When Vin >= BIT_ADC_COMP_TH_L_CH2 and Vin <= BIT_ADC_COMP_TH_H_CH2, comparison criterion matches. 3: When Vin < BIT_ADC_COMP_TH_L_CH2 or Vin > BIT_ADC_COMP_TH_H_CH2,comparison criterion matches. */
#define ADC_SHIFT_CH1_COMP_CTRL                 2
#define ADC_MASK_CH1_COMP_CTRL                  ((u32)0x00000003 << 2)                              /*!<R/W 0  This field defines ADC channel comparison criteria which would notify system by interrupt when the criterion matches. Once a criterion matches, ADC should send an interrupt signal to system if the related interrupt mask is unmask. ADC also updates comparison results in REG_ADC_COMP_STS. 0: When Vin < BIT_ADC_COMP_TH_L_CH1, comparison criterion matches. 1: When Vin > BIT_ADC_COMP_TH_H_CH1, comparison criterion matches. 2: When Vin >= BIT_ADC_COMP_TH_L_CH1 and Vin <= BIT_ADC_COMP_TH_H_CH1, comparison criterion matches. 3: When Vin < BIT_ADC_COMP_TH_L_CH1 or Vin > BIT_ADC_COMP_TH_H_CH1,comparison criterion matches. */
#define ADC_SHIFT_CH0_COMP_CTRL                 0
#define ADC_MASK_CH0_COMP_CTRL                  ((u32)0x00000003 << 0)                              /*!<R/W 0  This field defines ADC channel comparison criteria which would notify system by interrupt when the criterion matches. Once a criterion matches, ADC should send an interrupt signal to system if the related interrupt mask is unmask. ADC also updates comparison results in REG_ADC_COMP_STS. 0: When Vin < BIT_ADC_COMP_TH_L_CH0, comparison criterion matches. 1: When Vin > BIT_ADC_COMP_TH_H_CH0, comparison criterion matches. 2: When Vin >= BIT_ADC_COMP_TH_L_CH0 and Vin <= BIT_ADC_COMP_TH_H_CH0, comparison criterion matches. 3: When Vin < BIT_ADC_COMP_TH_L_CH0 or Vin > BIT_ADC_COMP_TH_H_CH0,comparison criterion matches. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_COMP_STS
 * @brief  ADC Comparison Status Register            (@ 0X030)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CH8_COMP_STS                  16
#define ADC_MASK_CH8_COMP_STS                   ((u32)0x00000003 << 16)                             /*!<R 0  This field reflects comparison result of channel 8 immediately. */
#define ADC_SHIFT_CH7_COMP_STS                  14
#define ADC_MASK_CH7_COMP_STS                   ((u32)0x00000003 << 14)                             /*!<R 0  This field reflects comparison result of channel 7 immediately. */
#define ADC_SHIFT_CH6_COMP_STS                  12
#define ADC_MASK_CH6_COMP_STS                   ((u32)0x00000003 << 12)                             /*!<R 0  This field reflects comparison result of channel 6 immediately. */
#define ADC_SHIFT_CH5_COMP_STS                  10
#define ADC_MASK_CH5_COMP_STS                   ((u32)0x00000003 << 10)                             /*!<R 0  This field reflects comparison result of channel 5 immediately. */
#define ADC_SHIFT_CH4_COMP_STS                  8
#define ADC_MASK_CH4_COMP_STS                   ((u32)0x00000003 << 8)                              /*!<R 0  This field reflects comparison result of channel 4 immediately. */
#define ADC_SHIFT_CH3_COMP_STS                  6
#define ADC_MASK_CH3_COMP_STS                   ((u32)0x00000003 << 6)                              /*!<R 0  This field reflects comparison result of channel 3 immediately. */
#define ADC_SHIFT_CH2_COMP_STS                  4
#define ADC_MASK_CH2_COMP_STS                   ((u32)0x00000003 << 4)                              /*!<R 0  This field reflects comparison result of channel 2 immediately. */
#define ADC_SHIFT_CH1_COMP_STS                  2
#define ADC_MASK_CH1_COMP_STS                   ((u32)0x00000003 << 2)                              /*!<R 0  This field reflects comparison result of channel 1 immediately. */
#define ADC_SHIFT_CH0_COMP_STS                  0
#define ADC_MASK_CH0_COMP_STS                   ((u32)0x00000003 << 0)                              /*!<R 0  This field reflects comparison result of channel 0 immediately. */
/** @} */

