Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_adc_type.h
/**************************************************************************//**
 * @defgroup ADC_CHSW_LIST_0
 * @brief  ADC Channel Swtich List 0 Register        (@ 0X034)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CHSW_7                        28
#define ADC_MASK_CHSW_7                         ((u32)0x0000000F << 28)                             /*!<R/W 0  This field defines the 8th channel to do a conversion when a conversion event takes place. */
#define ADC_SHIFT_CHSW_6                        24
#define ADC_MASK_CHSW_6                         ((u32)0x0000000F << 24)                             /*!<R/W 0  This field defines the 7th channel to do a conversion when a conversion event takes place. */
#define ADC_SHIFT_CHSW_5                        20
#define ADC_MASK_CHSW_5                         ((u32)0x0000000F << 20)                             /*!<R/W 0  This field defines the 6th channel to do a conversion when a conversion event takes place. */
#define ADC_SHIFT_CHSW_4                        16
#define ADC_MASK_CHSW_4                         ((u32)0x0000000F << 16)                             /*!<R/W 0  This field defines the 5th channel to do a conversion when a conversion event takes place. */
#define ADC_SHIFT_CHSW_3                        12
#define ADC_MASK_CHSW_3                         ((u32)0x0000000F << 12)                             /*!<R/W 0  This field defines the 4th channel to do a conversion when a conversion event takes place. */
#define ADC_SHIFT_CHSW_2                        8
#define ADC_MASK_CHSW_2                         ((u32)0x0000000F << 8)                              /*!<R/W 0  This field defines the 3rd channel to do a conversion when a conversion event takes place. */
#define ADC_SHIFT_CHSW_1                        4
#define ADC_MASK_CHSW_1                         ((u32)0x0000000F << 4)                              /*!<R/W 0  This field defines the 2nd channel to do a conversion when a conversion event takes place. */
#define ADC_SHIFT_CHSW_0                        0
#define ADC_MASK_CHSW_0                         ((u32)0x0000000F << 0)                              /*!<R/W 0  This field defines the 1st channel to do a conversion when a conversion event takes place. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_CHSW_LIST_1
 * @brief  ADC Channel Swtich List 1 Register        (@ 0X038)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CHSW_15                       28
#define ADC_MASK_CHSW_15                        ((u32)0x0000000F << 28)                             /*!<R/W 0  This field defines the 16th channel to do a conversion when a conversion event takes place. */
#define ADC_SHIFT_CHSW_14                       24
#define ADC_MASK_CHSW_14                        ((u32)0x0000000F << 24)                             /*!<R/W 0  This field defines the 15th channel to do a conversion when a conversion event takes place. */
#define ADC_SHIFT_CHSW_13                       20
#define ADC_MASK_CHSW_13                        ((u32)0x0000000F << 20)                             /*!<R/W 0  This field defines the 14th channel to do a conversion when a conversion event takes place. */
#define ADC_SHIFT_CHSW_12                       16
#define ADC_MASK_CHSW_12                        ((u32)0x0000000F << 16)                             /*!<R/W 0  This field defines the 13th channel to do a conversion when a conversion event takes place. */
#define ADC_SHIFT_CHSW_11                       12
#define ADC_MASK_CHSW_11                        ((u32)0x0000000F << 12)                             /*!<R/W 0  This field defines the 12th channel to do a conversion when a conversion event takes place. */
#define ADC_SHIFT_CHSW_10                       8
#define ADC_MASK_CHSW_10                        ((u32)0x0000000F << 8)                              /*!<R/W 0  This field defines the 11th channel to do a conversion when a conversion event takes place. */
#define ADC_SHIFT_CHSW_9                        4
#define ADC_MASK_CHSW_9                         ((u32)0x0000000F << 4)                              /*!<R/W 0  This field defines the 10th channel to do a conversion when a conversion event takes place. */
#define ADC_SHIFT_CHSW_8                        0
#define ADC_MASK_CHSW_8                         ((u32)0x0000000F << 0)                              /*!<R/W 0  This field defines the 9th channel to do a conversion when a conversion event takes place. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_RST_LIST
 * @brief  ADC Reset List Register                   (@ 0X03C)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_RST_LIST                      0
#define ADC_BIT_RST_LIST                        ((u32)0x00000001 << 0)                              /*!<R/W 0  This bit controls to reset the channel switch to default state or not. Once this bit is set, the auto/manual channel switch goes to the first channel as a default state. 0: Do not reset conversion list to default state. 1: Reset conversion list to default state. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_AUTO_CHSW_CTRL
 * @brief  ADC Auto Channel Switch Control Register  (@ 0X040)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_AUTO_CHSW_EN                  0
#define ADC_BIT_AUTO_CHSW_EN                    ((u32)0x00000001 << 0)                              /*!<R/W 0  This bit controls the automatic channel swtich enabled or disabled. 0: Disable the automatic channel switch. If an automatic channel switch is in progess, writing 0 will terminate the automatic channel switch. 1: Enable the automatic channel switch. When setting this bit, an automatic channel switch starts from the first channel in the channel switch list. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_SW_TRIG
 * @brief  ADC Software Trigger Register             (@ 0X044)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_SW_TRIG                       0
#define ADC_BIT_SW_TRIG                         ((u32)0x00000001 << 0)                              /*!<R/W 0  This bit controls the ADC module to do a conversion. Every time this bit is set to 1, ADC module would switch to a new channel and do one conversion. Therefore, this bit could be used as a start-convert event which is controlled by software. Every time a conversion is done, software MUST clear this bit manually. 0: Disable the analog module and analog mux. 1: Enable the analog module and analog mux. And then start a new channel conversion. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_LAST_ITEM
 * @brief  ADC Last Item Register                    (@ 0X048)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_LAST_ITEM                     0
#define ADC_MASK_LAST_ITEM                      ((u32)0x0000000F << 0)                              /*!<R 0  This field reflects the last used channel. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_STS
 * @brief  ADC Busy_Ready Status Register            (@ 0X04C)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_STS_EMPTY                     2
#define ADC_BIT_STS_EMPTY                       ((u32)0x00000001 << 2)                              /*!<R 0  This bit directly reflects the FIFO empty status. 0: FIFO is empty. 1: FIFO is NOT empty. */
#define ADC_SHIFT_STS_FULL                      1
#define ADC_BIT_STS_FULL                        ((u32)0x00000001 << 1)                              /*!<R 0  This bit directly reflects the FIFO full status. 0: FIFO is NOT full. 1: FIFO is full. */
#define ADC_SHIFT_STS_BUSY                      0
#define ADC_BIT_STS_BUSY                        ((u32)0x00000001 << 0)                              /*!<R 0  This bit reflects the ADC is busy or not. If the ADC is processing a conversion of a channel, this bit remains 1 which indicates it's busy. Once a conversion is done, this bit becomes 0 which indicates its' ready to do another conversion. 0: The ADC is ready. 1: The ADC is busy. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_INTR_CTRL
 * @brief  ADC Interrupt Control Register            (@ 0X050)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_IT_COMP_CH8_EN                16
#define ADC_BIT_IT_COMP_CH8_EN                  ((u32)0x00000001 << 16)                             /*!<R/W 0  This bit controls the interrupt is enabled or not when channel 8 comparison criterion matches. 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_COMP_CH7_EN                15
#define ADC_BIT_IT_COMP_CH7_EN                  ((u32)0x00000001 << 15)                             /*!<R/W 0  This bit controls the interrupt is enabled or not when channel 7 comparison criterion matches. 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_COMP_CH6_EN                14
#define ADC_BIT_IT_COMP_CH6_EN                  ((u32)0x00000001 << 14)                             /*!<R/W 0  This bit controls the interrupt is enabled or not when channel 6 comparison criterion matches. 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_COMP_CH5_EN                13
#define ADC_BIT_IT_COMP_CH5_EN                  ((u32)0x00000001 << 13)                             /*!<R/W 0  This bit controls the interrupt is enabled or not when channel 5 comparison criterion matches. 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_COMP_CH4_EN                12
#define ADC_BIT_IT_COMP_CH4_EN                  ((u32)0x00000001 << 12)                             /*!<R/W 0  This bit controls the interrupt is enabled or not when channel 4 comparison criterion matches. 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_COMP_CH3_EN                11
#define ADC_BIT_IT_COMP_CH3_EN                  ((u32)0x00000001 << 11)                             /*!<R/W 0  This bit controls the interrupt is enabled or not when channel 3 comparison criterion matches. 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_COMP_CH2_EN                10
#define ADC_BIT_IT_COMP_CH2_EN                  ((u32)0x00000001 << 10)                             /*!<R/W 0  This bit controls the interrupt is enabled or not when channel 2 comparison criterion matches. 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_COMP_CH1_EN                9
#define ADC_BIT_IT_COMP_CH1_EN                  ((u32)0x00000001 << 9)                              /*!<R/W 0  This bit controls the interrupt is enabled or not when channel 1 comparison criterion matches. 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_COMP_CH0_EN                8
#define ADC_BIT_IT_COMP_CH0_EN                  ((u32)0x00000001 << 8)                              /*!<R/W 0  This bit controls the interrupt is enabled or not when channel 0 comparison criterion matches. 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_ERR_EN                     7
#define ADC_BIT_IT_ERR_EN                       ((u32)0x00000001 << 7)                              /*!<R/W 0  This bit controls the interrupt is enabled or not when an error state takes place. 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_DAT_OVW_EN                 6
#define ADC_BIT_IT_DAT_OVW_EN                   ((u32)0x00000001 << 6)                              /*!<R/W 0  This bit controls the interrupt is enabled or not when a data overwritten situation takes place. 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_FIFO_EMPTY_EN              5
#define ADC_BIT_IT_FIFO_EMPTY_EN                ((u32)0x00000001 << 5)                              /*!<R/W 0  This bit controls the interrupt is enabled or not when a FIFO empty state takes place. 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_FIFO_OVER_EN               4
#define ADC_BIT_IT_FIFO_OVER_EN                 ((u32)0x00000001 << 4)                              /*!<R/W 0  This bit controls the interrupt is enabled or not when a FIFO overflow state takes place. 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_FIFO_FULL_EN               3
#define ADC_BIT_IT_FIFO_FULL_EN                 ((u32)0x00000001 << 3)                              /*!<R/W 0  This bit controls the interrupt is enabled or not when a FIFO full state takes place. 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_CHCV_END_EN                2
#define ADC_BIT_IT_CHCV_END_EN                  ((u32)0x00000001 << 2)                              /*!<R/W 0  This bit controls the interrupt is enbled or not when a particular channel conversion is done. Please refer to REG_ADC_IT_CHNO_CON 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_CV_END_EN                  1
#define ADC_BIT_IT_CV_END_EN                    ((u32)0x00000001 << 1)                              /*!<R/W 0  This bit controls the interrupt is enbled or not every time a conversion is done. No matter ADC module is in what kind of operation mode. Every time a conversion is executed, ADC module would notify system if this bit is set. 0: This interrupt is disabled. 1: This interrupt is enabled. */
#define ADC_SHIFT_IT_CVLIST_END_EN              0
#define ADC_BIT_IT_CVLIST_END_EN                ((u32)0x00000001 << 0)                              /*!<R/W 0  This bit controls the interrupt is enbled or not when a conversion of the last channel in the list is done. For example, in automatic mode conversions would be executed coninuously. Every time the last channel conversion is done, which means all channel conversions in the list is done, ADC could notify system if this bit is set. 0: This interrupt is disabled. 1: This interrupt is enabled. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_INTR_RAW_STS
 * @brief  ADC Interrupt RAW Status Register         (@ 0X054)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_IT_COMP_CH8_RAW_STS           16
#define ADC_BIT_IT_COMP_CH8_RAW_STS             ((u32)0x00000001 << 16)                             /*!<R 0  This bit is the raw status of channel 8 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH7_RAW_STS           15
#define ADC_BIT_IT_COMP_CH7_RAW_STS             ((u32)0x00000001 << 15)                             /*!<R 0  This bit is the raw status of channel 7 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH6_RAW_STS           14
#define ADC_BIT_IT_COMP_CH6_RAW_STS             ((u32)0x00000001 << 14)                             /*!<R 0  This bit is the raw status of channel 6 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH5_RAW_STS           13
#define ADC_BIT_IT_COMP_CH5_RAW_STS             ((u32)0x00000001 << 13)                             /*!<R 0  This bit is the raw status of channel 5 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH4_RAW_STS           12
#define ADC_BIT_IT_COMP_CH4_RAW_STS             ((u32)0x00000001 << 12)                             /*!<R 0  This bit is the raw status of channel 4 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH3_RAW_STS           11
#define ADC_BIT_IT_COMP_CH3_RAW_STS             ((u32)0x00000001 << 11)                             /*!<R 0  This bit is the raw status of channel 3 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH2_RAW_STS           10
#define ADC_BIT_IT_COMP_CH2_RAW_STS             ((u32)0x00000001 << 10)                             /*!<R 0  This bit is the raw status of channel 2 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH1_RAW_STS           9
#define ADC_BIT_IT_COMP_CH1_RAW_STS             ((u32)0x00000001 << 9)                              /*!<R 0  This bit is the raw status of channel 1 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH0_RAW_STS           8
#define ADC_BIT_IT_COMP_CH0_RAW_STS             ((u32)0x00000001 << 8)                              /*!<R 0  This bit is the raw status of channel 0 comparison interrupt. */
#define ADC_SHIFT_IT_ERR_RAW_STS                7
#define ADC_BIT_IT_ERR_RAW_STS                  ((u32)0x00000001 << 7)                              /*!<R 0  This bit is the raw status of error interrupt. */
#define ADC_SHIFT_IT_DAT_OVW_RAW_STS            6
#define ADC_BIT_IT_DAT_OVW_RAW_STS              ((u32)0x00000001 << 6)                              /*!<R 0  This bit is the raw status of global data register overwritten interrupt. */
#define ADC_SHIFT_IT_FIFO_EMPTY_RAW_STS         5
#define ADC_BIT_IT_FIFO_EMPTY_RAW_STS           ((u32)0x00000001 << 5)                              /*!<R 0  This bit is the raw status of FIFO empty interrupt. */
#define ADC_SHIFT_IT_FIFO_OVER_RAW_STS          4
#define ADC_BIT_IT_FIFO_OVER_RAW_STS            ((u32)0x00000001 << 4)                              /*!<R 0  This bit is the raw status of FIFO overflow interrupt. */
#define ADC_SHIFT_IT_FIFO_FULL_RAW_STS          3
#define ADC_BIT_IT_FIFO_FULL_RAW_STS            ((u32)0x00000001 << 3)                              /*!<R 0  This bit is the raw status of FIFO full interrupt. */
#define ADC_SHIFT_IT_CHCV_END_RAW_STS           2
#define ADC_BIT_IT_CHCV_END_RAW_STS             ((u32)0x00000001 << 2)                              /*!<R 0  This bit is the raw status of particular channel conversion end interrupt. */
#define ADC_SHIFT_IT_CV_END_RAW_STS             1
#define ADC_BIT_IT_CV_END_RAW_STS               ((u32)0x00000001 << 1)                              /*!<R 0  This bit is the raw status of each conversion end interrupt. */
#define ADC_SHIFT_IT_CVLIST_END_RAW_STS         0
#define ADC_BIT_IT_CVLIST_END_RAW_STS           ((u32)0x00000001 << 0)                              /*!<R 0  This bit is the raw status of channel conversion list end interrupt. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_INTR_STS
 * @brief  ADC Interrupt Status Register             (@ 0X058)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_IT_COMP_CH8_STS               16
#define ADC_BIT_IT_COMP_CH8_STS                 ((u32)0x00000001 << 16)                             /*!<R/W1C 0  This bit is the status of channel 8 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH7_STS               15
#define ADC_BIT_IT_COMP_CH7_STS                 ((u32)0x00000001 << 15)                             /*!<R/W1C 0  This bit is the status of channel 7 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH6_STS               14
#define ADC_BIT_IT_COMP_CH6_STS                 ((u32)0x00000001 << 14)                             /*!<R/W1C 0  This bit is the status of channel 6 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH5_STS               13
#define ADC_BIT_IT_COMP_CH5_STS                 ((u32)0x00000001 << 13)                             /*!<R/W1C 0  This bit is the status of channel 5 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH4_STS               12
#define ADC_BIT_IT_COMP_CH4_STS                 ((u32)0x00000001 << 12)                             /*!<R/W1C 0  This bit is the status of channel 4 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH3_STS               11
#define ADC_BIT_IT_COMP_CH3_STS                 ((u32)0x00000001 << 11)                             /*!<R/W1C 0  This bit is the status of channel 3 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH2_STS               10
#define ADC_BIT_IT_COMP_CH2_STS                 ((u32)0x00000001 << 10)                             /*!<R/W1C 0  This bit is the status of channel 2 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH1_STS               9
#define ADC_BIT_IT_COMP_CH1_STS                 ((u32)0x00000001 << 9)                              /*!<R/W1C 0  This bit is the status of channel 1 comparison interrupt. */
#define ADC_SHIFT_IT_COMP_CH0_STS               8
#define ADC_BIT_IT_COMP_CH0_STS                 ((u32)0x00000001 << 8)                              /*!<R/W1C 0  This bit is the status of channel 0 comparison interrupt. */
#define ADC_SHIFT_IT_ERR_STS                    7
#define ADC_BIT_IT_ERR_STS                      ((u32)0x00000001 << 7)                              /*!<R/W1C 0  This bit is the status of error interrupt. */
#define ADC_SHIFT_IT_DAT_OVW_STS                6
#define ADC_BIT_IT_DAT_OVW_STS                  ((u32)0x00000001 << 6)                              /*!<R/W1C 0  This bit is the status of global data register overwritten interrupt. */
#define ADC_SHIFT_IT_FIFO_EMPTY_STS             5
#define ADC_BIT_IT_FIFO_EMPTY_STS               ((u32)0x00000001 << 5)                              /*!<R/W1C 0  This bit is the status of FIFO empty interrupt. */
#define ADC_SHIFT_IT_FIFO_OVER_STS              4
#define ADC_BIT_IT_FIFO_OVER_STS                ((u32)0x00000001 << 4)                              /*!<R/W1C 0  This bit is the status of FIFO overflow interrupt. */
#define ADC_SHIFT_IT_FIFO_FULL_STS              3
#define ADC_BIT_IT_FIFO_FULL_STS                ((u32)0x00000001 << 3)                              /*!<R/W1C 0  This bit is the status of FIFO full interrupt. */
#define ADC_SHIFT_IT_CHCV_END_STS               2
#define ADC_BIT_IT_CHCV_END_STS                 ((u32)0x00000001 << 2)                              /*!<R/W1C 0  This bit is the status of particular channel conversion end interrupt. */
#define ADC_SHIFT_IT_CV_END_STS                 1
#define ADC_BIT_IT_CV_END_STS                   ((u32)0x00000001 << 1)                              /*!<R/W1C 0  This bit is the status of each conversion end interrupt. */
#define ADC_SHIFT_IT_CVLIST_END_STS             0
#define ADC_BIT_IT_CVLIST_END_STS               ((u32)0x00000001 << 0)                              /*!<R/W1C 0  This bit is the status of channel conversion list end interrupt. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_IT_CHNO_CON
 * @brief  ADC Conversion Interrupt Channel Number Configuration Register (@ 0X05C)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_IT_CHNO_CON                   0
#define ADC_MASK_IT_CHNO_CON                    ((u32)0x00000007 << 0)                              /*!<R/W 0  This field defines that ADC module should send interrupt signal to system when a conversion which of channel number is the same as this field. This register is only valid when BIT_ADC_IT_CHCV_END_EN is set. BIT_ADC_IT_CHNO_CON: Channel number. */
/** @} */

