Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_adc_type.h
/**************************************************************************//**
 * @defgroup ADC_FULL_LVL
 * @brief  ADC FIFO Full Level Register              (@ 0X060)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_FULL_LVL                      0
#define ADC_MASK_FULL_LVL                       ((u32)0x0000003F << 0)                              /*!<R/W 0  This field defines the FIFO full entry threshold level and it is used for FIFO full interrupt. It should be set according to ADC FIFO depth. A value of 0 sets the threshold for 1 entry, and a value of 15 sets the threshold for 16 entries. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_TRIG_TIMER_SEL
 * @brief  ADC Trigger Timer Select Register         (@ 0X064)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_TRIG_TIMER_SEL                0
#define ADC_MASK_TRIG_TIMER_SEL                 ((u32)0x00000007 << 0)                              /*!<R/W 0  This three bits defines which timer channel would be used to make ADC module do a conversion. BIT_ADC_EXT_WK_TIMER_SEL is 0: Timer module 0 is used as the comparator external trigger source. 1: Timer module 1 is used as the comparator external trigger source. . . . 7: Timer module 7 is used as the comparator external trigger source. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_DAT_GLOBAL
 * @brief  ADC Global Data Register                  (@ 0X068)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_DAT_GLOBAL_CH                 23
#define ADC_MASK_DAT_GLOBAL_CH                  ((u32)0x00000007 << 23)                             /*!<R/W 0  This field indicates which channel data is in BIT_ADC_DATA_GLOBAL */
#define ADC_SHIFT_DAT_GLOBAL_RDY                22
#define ADC_BIT_DAT_GLOBAL_RDY                  ((u32)0x00000001 << 22)                             /*!<R/W 0  This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of REG_ADC_DATA_GLOBAL. */
#define ADC_SHIFT_DAT_GLOBAL_OVW                21
#define ADC_BIT_DAT_GLOBAL_OVW                  ((u32)0x00000001 << 21)                             /*!<R/W 0  This bit indicates that there is a data overwritten situation in BIT_ADC_DATA_GLOBAL takes place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written into data field. 0: There is no data overwritten case. 1: There is a data overwritten case. */
#define ADC_SHIFT_DAT_GLOBAL_DAT                0
#define ADC_MASK_DAT_GLOBAL_DAT                 ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field contains the newest conversion data of a conversion channel in the list. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_DAT_CH0
 * @brief  ADC Channel 0 Data Register               (@ 0X06C)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_DAT_CH0_RDY                   22
#define ADC_BIT_DAT_CH0_RDY                     ((u32)0x00000001 << 22)                             /*!<R/W 0  This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of dat_ch0. */
#define ADC_SHIFT_DAT_CH0_OVW                   21
#define ADC_BIT_DAT_CH0_OVW                     ((u32)0x00000001 << 21)                             /*!<R/W 0  This bit indicates that there is a data overwritten situation in dat_ch0 takes place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written into data field. 0: There is no data overwritten case. 1: There is a data overwritten case. */
#define ADC_SHIFT_DAT_CH0_DAT                   0
#define ADC_MASK_DAT_CH0_DAT                    ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field contains the newest conversion data of channel 0. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_DAT_CH1
 * @brief  ADC Channel 1 Data Register               (@ 0X070)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_DAT_CH1_RDY                   22
#define ADC_BIT_DAT_CH1_RDY                     ((u32)0x00000001 << 22)                             /*!<R/W 0  This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of dat_ch1. */
#define ADC_SHIFT_DAT_CH1_OVW                   21
#define ADC_BIT_DAT_CH1_OVW                     ((u32)0x00000001 << 21)                             /*!<R/W 0  This bit indicates that there is a data overwritten situation in dat_ch1 takes place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written into data field. 0: There is no data overwritten case. 1: There is a data overwritten case. */
#define ADC_SHIFT_DAT_CH1_DAT                   0
#define ADC_MASK_DAT_CH1_DAT                    ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field contains the newest conversion data of channel 1. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_DAT_CH2
 * @brief  ADC Channel 2 Data Register               (@ 0X074)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_DAT_CH2_RDY                   22
#define ADC_BIT_DAT_CH2_RDY                     ((u32)0x00000001 << 22)                             /*!<R/W 0  This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of dat_ch2. */
#define ADC_SHIFT_DAT_CH2_OVW                   21
#define ADC_BIT_DAT_CH2_OVW                     ((u32)0x00000001 << 21)                             /*!<R/W 0  This bit indicates that there is a data overwritten situation in dat_ch2 takes place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written into data field. 0: There is no data overwritten case. 1: There is a data overwritten case. */
#define ADC_SHIFT_DAT_CH2_DAT                   0
#define ADC_MASK_DAT_CH2_DAT                    ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field contains the newest conversion data of channel 2. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_DAT_CH3
 * @brief  ADC Channel 3 Data Register               (@ 0X078)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_DAT_CH3_RDY                   22
#define ADC_BIT_DAT_CH3_RDY                     ((u32)0x00000001 << 22)                             /*!<R/W 0  This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of dat_ch3. */
#define ADC_SHIFT_DAT_CH3_OVW                   21
#define ADC_BIT_DAT_CH3_OVW                     ((u32)0x00000001 << 21)                             /*!<R/W 0  This bit indicates that there is a data overwritten situation in dat_ch3 takes place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written into data field. 0: There is no data overwritten case. 1: There is a data overwritten case. */
#define ADC_SHIFT_DAT_CH3_DAT                   0
#define ADC_MASK_DAT_CH3_DAT                    ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field contains the newest conversion data of channel 3. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_DAT_CH4
 * @brief  ADC Channel 4 Data Register               (@ 0X07C)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_DAT_CH4_RDY                   22
#define ADC_BIT_DAT_CH4_RDY                     ((u32)0x00000001 << 22)                             /*!<R/W 0  This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of dat_ch4. */
#define ADC_SHIFT_DAT_CH4_OVW                   21
#define ADC_BIT_DAT_CH4_OVW                     ((u32)0x00000001 << 21)                             /*!<R/W 0  This bit indicates that there is a data overwritten situation in dat_ch4 takes place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written into data field. 0: There is no data overwritten case. 1: There is a data overwritten case. */
#define ADC_SHIFT_DAT_CH4_DAT                   0
#define ADC_MASK_DAT_CH4_DAT                    ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field contains the newest conversion data of channel 4. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_DAT_CH5
 * @brief  ADC Channel 5 Data Register               (@ 0X080)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_DAT_CH5_RDY                   22
#define ADC_BIT_DAT_CH5_RDY                     ((u32)0x00000001 << 22)                             /*!<R/W 0  This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of dat_ch5. */
#define ADC_SHIFT_DAT_CH5_OVW                   21
#define ADC_BIT_DAT_CH5_OVW                     ((u32)0x00000001 << 21)                             /*!<R/W 0  This bit indicates that there is a data overwritten situation in dat_ch5 takes place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written into data field. 0: There is no data overwritten case. 1: There is a data overwritten case. */
#define ADC_SHIFT_DAT_CH5_DAT                   0
#define ADC_MASK_DAT_CH5_DAT                    ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field contains the newest conversion data of channel 5. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_DAT_CH6
 * @brief  ADC Channel 6 Data Register               (@ 0X084)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_DAT_CH6_RDY                   22
#define ADC_BIT_DAT_CH6_RDY                     ((u32)0x00000001 << 22)                             /*!<R/W 0  This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of dat_ch6. */
#define ADC_SHIFT_DAT_CH6_OVW                   21
#define ADC_BIT_DAT_CH6_OVW                     ((u32)0x00000001 << 21)                             /*!<R/W 0  This bit indicates that there is a data overwritten situation in dat_ch6 takes place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written into data field. 0: There is no data overwritten case. 1: There is a data overwritten case. */
#define ADC_SHIFT_DAT_CH6_DAT                   0
#define ADC_MASK_DAT_CH6_DAT                    ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field contains the newest conversion data of channel 6. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_DAT_CH7
 * @brief  ADC Channel 7 Data Register               (@ 0X088)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_DAT_CH7_RDY                   22
#define ADC_BIT_DAT_CH7_RDY                     ((u32)0x00000001 << 22)                             /*!<R/W 0  This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of dat_ch7. */
#define ADC_SHIFT_DAT_CH7_OVW                   21
#define ADC_BIT_DAT_CH7_OVW                     ((u32)0x00000001 << 21)                             /*!<R/W 0  This bit indicates that there is a data overwritten situation in dat_ch7 takes place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written into data field. 0: There is no data overwritten case. 1: There is a data overwritten case. */
#define ADC_SHIFT_DAT_CH7_DAT                   0
#define ADC_MASK_DAT_CH7_DAT                    ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field contains the newest conversion data of channel 7. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_DAT_CH8
 * @brief  ADC Channel 8 Data Register               (@ 0X08C)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_DAT_CH8_RDY                   22
#define ADC_BIT_DAT_CH8_RDY                     ((u32)0x00000001 << 22)                             /*!<R/W 0  This bit indicates that a conversion is done. Every time a conversion is done, this bit should be set to 1 and it would be cleared to 0 when a read operation of dat_ch8. */
#define ADC_SHIFT_DAT_CH8_OVW                   21
#define ADC_BIT_DAT_CH8_OVW                     ((u32)0x00000001 << 21)                             /*!<R/W 0  This bit indicates that there is a data overwritten situation in dat_ch8 takes place. A data overwritten situation is that a former conversion data is NOT read before a new conversion is written into data field. 0: There is no data overwritten case. 1: There is a data overwritten case. */
#define ADC_SHIFT_DAT_CH8_DAT                   0
#define ADC_MASK_DAT_CH8_DAT                    ((u32)0x00000FFF << 0)                              /*!<R/W 0  This field contains the newest conversion data of channel 8. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_DMA_CON
 * @brief  ADC DMA Control Register                  (@ 0X090)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_DMA_CON_LVL                   8
#define ADC_MASK_DMA_CON_LVL                    ((u32)0x0000003F << 8)                              /*!<R/W 0  This field defines the FIFO threshold level that ADC module should make a DMA request to DMA module. A value of 0 sets the threshold for 1 entry, and a value of 15 sets the threshold for 16 entries. */
#define ADC_SHIFT_DMA_CON_EN                    0
#define ADC_BIT_DMA_CON_EN                      ((u32)0x00000001 << 0)                              /*!<R/W 0  This bit controls that DMA function of ADC is enabled or not. 0: ADC DMA is disabled. 1: ADC DMA is enabled. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_FLR
 * @brief  ADC FIFO Level Register                   (@ 0X094)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_FLR                           0
#define ADC_MASK_FLR                            ((u32)0x0000007F << 0)                              /*!<R/W 0  This field records the current ADC FIFO entry number. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_CLR_FIFO
 * @brief  ADC Clear FIFO Register                   (@ 0X098)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CLR_FIFO                      0
#define ADC_BIT_CLR_FIFO                        ((u32)0x00000001 << 0)                              /*!<R/W 0  This bit is used to clear FIFO contents and makes it to the default status. Every time this bit is set to 1, FIFO would be cleared to the default status. Software should set this bit to 0 after FIFO is cleared. 0: No effect. 1: Clear FIFO. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_CLK_DIV
 * @brief  ADC Clock Division Register               (@ 0X09C)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_CLK_DIV                       0
#define ADC_MASK_CLK_DIV                        ((u32)0x00000007 << 0)                              /*!<R/W 0  This field defines clock divider level of ADC module. A value of 0 is for clock divided by 5. A value of 1 is for clock divided by 10. A value of 2 is for clock divided by 16. A value of 3 is for clock divided by 32. A value of 4 is for clock divided by 64. */
/** @} */

/**************************************************************************//**
 * @defgroup ADC_DLY_CNT
 * @brief  ADC Delay Count Register                  (@ 0X0A0)
 * @{
 *****************************************************************************/
/* Weide removed the auto-generated bitfields on Jason's advice, as these registers will not be used by customer.*/

/**************************************************************************//**
 * @defgroup ADC_DBG_SEL
 * @brief  ADC Debug Select Register                 (@ 0X0A4)
 * @{
 *****************************************************************************/
/* Weide removed the auto-generated bitfields on Jason's advice, as these registers will not be used by customer.*/


/**************************************************************************//**
 * @defgroup ADC_VREF_SETTLE_TIME
 * @brief  ADC Reference Voltage Settle Time Register (@ 0X0BC)
 * @{
 *****************************************************************************/
#define ADC_SHIFT_VREF_SETTLE_TIME                   0
#define ADC_MASK_VREF_SETTLE_TIME                    ((u32)0x00000003 << 0)                              /*!<R/W 0  This field defines the time required for the reference voltage to settle to ensure stability of ADC operations. By default, it will be 20us. 0: 20 us 1: 40 us 2: 80 us 3: 160 us */
/** @} */


