Ameba-AIoT/ameba-arduino-pro2/Arduino_package/hardware/system/component/soc/8735b/fwlib/rtl8735b/include/rtl8735b_adc_type.h
/**************************************************************************//**
 * @defgroup rtl8735b_ADC
 * @{
 * @brief rtl8735b_ADC Register Declaration
 *****************************************************************************/
typedef struct {
	__IO uint32_t ADC_CONF ;                          /*!<  ADC Configuration Register register,  Address offset: 0x000 */
	__IO uint32_t ADC_IN_TYPE ;                       /*!<  ADC Input Type Register register,  Address offset: 0x004 */
	__IO uint32_t ADC_COMP_TH_CH0 ;                   /*!<  ADC Channel 0 Comparison Threshold Register register,  Address offset: 0x008 */
	__IO uint32_t ADC_COMP_TH_CH1 ;                   /*!<  ADC Channel 1 Comparison Threshold Register register,  Address offset: 0x00C */
	__IO uint32_t ADC_COMP_TH_CH2 ;                   /*!<  ADC Channel 2 Comparison Threshold Register register,  Address offset: 0x010 */
	__IO uint32_t ADC_COMP_TH_CH3 ;                   /*!<  ADC Channel 3 Comparison Threshold Register register,  Address offset: 0x014 */
	__IO uint32_t ADC_COMP_TH_CH4 ;                   /*!<  ADC Channel 4 Comparison Threshold Register register,  Address offset: 0x018 */
	__IO uint32_t ADC_COMP_TH_CH5 ;                   /*!<  ADC Channel 5 Comparison Threshold Register register,  Address offset: 0x01C */
	__IO uint32_t ADC_COMP_TH_CH6 ;                   /*!<  ADC Channel 6 Comparison Threshold Register register,  Address offset: 0x020 */
	__IO uint32_t ADC_COMP_TH_CH7 ;                   /*!<  ADC Channel 7 Comparison Threshold Register register,  Address offset: 0x024 */
	__IO uint32_t ADC_COMP_TH_CH8 ;                   /*!<  ADC Channel 8 Comparison Threshold Register register,  Address offset: 0x028 */
	__IO uint32_t ADC_COMP_CTRL ;                     /*!<  ADC Comparison Control Register register,  Address offset: 0x02C */
	__I  uint32_t ADC_COMP_STS ;                      /*!<  ADC Comparison Status Register register,  Address offset: 0x030 */
	__IO uint32_t ADC_CHSW_LIST_0 ;                   /*!<  ADC Channel Swtich List 0 Register register,  Address offset: 0x034 */
	__IO uint32_t ADC_CHSW_LIST_1 ;                   /*!<  ADC Channel Swtich List 1 Register register,  Address offset: 0x038 */
	__IO uint32_t ADC_RST_LIST ;                      /*!<  ADC Reset List Register register,  Address offset: 0x03C */
	__IO uint32_t ADC_AUTO_CHSW_CTRL ;                /*!<  ADC Auto Channel Switch Control Register register,  Address offset: 0x040 */
	__IO uint32_t ADC_SW_TRIG ;                       /*!<  ADC Software Trigger Register register,  Address offset: 0x044 */
	__I  uint32_t ADC_LAST_ITEM ;                     /*!<  ADC Last Item Register register,  Address offset: 0x048 */
	__I  uint32_t ADC_STS ;                           /*!<  ADC Busy_Ready Status Register register,  Address offset: 0x04C */
	__IO uint32_t ADC_INTR_CTRL ;                     /*!<  ADC Interrupt Control Register register,  Address offset: 0x050 */
	__I  uint32_t ADC_INTR_RAW_STS ;                  /*!<  ADC Interrupt RAW Status Register register,  Address offset: 0x054 */
	__IO uint32_t ADC_INTR_STS ;                      /*!<  ADC Interrupt Status Register register,  Address offset: 0x058 */
	__IO uint32_t ADC_IT_CHNO_CON ;                   /*!<  ADC Conversion Interrupt Channel Number Configuration Register register,  Address offset: 0x05C */
	__IO uint32_t ADC_FULL_LVL ;                      /*!<  ADC FIFO Full Level Register register,  Address offset: 0x060 */
	__IO uint32_t ADC_TRIG_TIMER_SEL ;                /*!<  ADC Trigger Timer Select Register register,  Address offset: 0x064 */
	__IO uint32_t ADC_DAT_GLOBAL ;                    /*!<  ADC Global Data Register register,  Address offset: 0x068 */
	__IO uint32_t ADC_DAT_CH0 ;                       /*!<  ADC Channel 0 Data Register register,  Address offset: 0x06C */
	__IO uint32_t ADC_DAT_CH1 ;                       /*!<  ADC Channel 1 Data Register register,  Address offset: 0x070 */
	__IO uint32_t ADC_DAT_CH2 ;                       /*!<  ADC Channel 2 Data Register register,  Address offset: 0x074 */
	__IO uint32_t ADC_DAT_CH3 ;                       /*!<  ADC Channel 3 Data Register register,  Address offset: 0x078 */
	__IO uint32_t ADC_DAT_CH4 ;                       /*!<  ADC Channel 4 Data Register register,  Address offset: 0x07C */
	__IO uint32_t ADC_DAT_CH5 ;                       /*!<  ADC Channel 5 Data Register register,  Address offset: 0x080 */
	__IO uint32_t ADC_DAT_CH6 ;                       /*!<  ADC Channel 6 Data Register register,  Address offset: 0x084 */
	__IO uint32_t ADC_DAT_CH7 ;                       /*!<  ADC Channel 7 Data Register register,  Address offset: 0x088 */
	__IO uint32_t ADC_DAT_CH8 ;                       /*!<  ADC Channel 8 Data Register register,  Address offset: 0x08C */
	__IO uint32_t ADC_DMA_CON ;                       /*!<  ADC DMA Control Register register,  Address offset: 0x090 */
	__IO uint32_t ADC_FLR ;                           /*!<  ADC FIFO Level Register register,  Address offset: 0x094 */
	__IO uint32_t ADC_CLR_FIFO ;                      /*!<  ADC Clear FIFO Register register,  Address offset: 0x098 */
	__IO uint32_t ADC_CLK_DIV ;                       /*!<  ADC Clock Division Register register,  Address offset: 0x09C */
	__IO uint32_t ADC_DLY_CNT ; 					  /*!<  ADC Delay Count Register register,  Address offset: 0x0A0 */
	__IO uint32_t ADC_DBG_SEL ; 					  /*!<  ADC Debug Select Register register,  Address offset: 0x0A4 */
	__I  uint32_t ADC_RSVD0 ;						  /*!<  Reserved0 register,  Address offset: 0x0A8 */
	__I  uint32_t ADC_RSVD1 ;						  /*!<  Reserved1 register,  Address offset: 0x0AC */
	__I  uint32_t ADC_RSVD2 ;						  /*!<  Reserved2 register,  Address offset: 0x0B0 */
	__I  uint32_t ADC_RSVD3 ;						  /*!<  Reserved3 register,  Address offset: 0x0B4 */
	__I  uint32_t ADC_RSVD4 ;						  /*!<  Reserved4 register,  Address offset: 0x0B8 */
	__IO uint32_t ADC_VREF_SETTLE_TIME ;			  /*!<  ADC Reference Voltage Settle Time Register register, Address offset: 0x0BC */
} ADC_TypeDef;
/** @} */

#endif
